# GridEndSegmentsLengthTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridFailures..::..GridEndSegmentsLengthTooShort Property
BuiltInFailures..::..GridFailures Class See Also
---
The end segment length for a grid must be at least [Length Value]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridEndSegmentsLengthTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridEndSegmentsLengthTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridEndSegmentsLengthTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridFailures Class
Autodesk.Revit.DB Namespace